Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # helm_release.oauth2_proxy[0] will be created
+ resource "helm_release" "oauth2_proxy" {
      + atomic                     = false
      + chart                      = "oauth2-proxy"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "oauth2-proxy"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://oauth2-proxy.github.io/manifests"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "7.12.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.vault will be updated in-place
~ resource "helm_release" "vault" {
        id                         = "vault"
        name                       = "vault"
      ~ timeout                    = 600 -> 300
      ~ wait_for_jobs              = false -> true
        # (26 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_instance will be updated in-place
~ resource "kubectl_manifest" "kubero_instance" {
      + field_manager           = "kubectl"
        id                      = "/apis/application.kubero.dev/v1alpha1/namespaces/kubero/kuberos/kubero"
        name                    = "kubero"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[0] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev"
        name                    = "kuberoaddonmemcacheds.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[1] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev"
        name                    = "kuberoaddonmongodbs.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[2] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev"
        name                    = "kuberoaddonmysqls.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[3] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev"
        name                    = "kuberoaddonpostgres.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[4] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev"
        name                    = "kuberoaddonrabbitmqs.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[5] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev"
        name                    = "kuberoaddonredis.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[6] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev"
        name                    = "kuberoapps.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[7] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev"
        name                    = "kuberobuilds.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[8] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev"
        name                    = "kuberocouchdbs.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[9] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev"
        name                    = "kuberoelasticsearches.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[10] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev"
        name                    = "kuberoes.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[11] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev"
        name                    = "kuberokafkas.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[12] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev"
        name                    = "kuberomails.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[13] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev"
        name                    = "kuberomemcacheds.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[14] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev"
        name                    = "kuberomongodbs.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[15] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev"
        name                    = "kuberomysqls.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[16] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev"
        name                    = "kuberopipelines.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[17] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev"
        name                    = "kuberopostgresqls.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[18] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev"
        name                    = "kuberoprometheuses.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[19] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev"
        name                    = "kuberorabbitmqs.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[20] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev"
        name                    = "kuberoredis.application.kubero.dev"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[21] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/api/v1/namespaces/kubero-operator-system/serviceaccounts/kubero-operator-controller-manager"
        name                    = "kubero-operator-controller-manager"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[22] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/roles/kubero-operator-leader-election-role"
        name                    = "kubero-operator-leader-election-role"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[23] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role"
        name                    = "kubero-operator-kuberoaddonmemcached-admin-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[24] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role"
        name                    = "kubero-operator-kuberoaddonmemcached-editor-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[25] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role"
        name                    = "kubero-operator-kuberoaddonmemcached-viewer-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[26] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role"
        name                    = "kubero-operator-kuberoaddonmongodb-admin-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[27] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role"
        name                    = "kubero-operator-kuberoaddonmongodb-editor-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[28] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role"
        name                    = "kubero-operator-kuberoaddonmongodb-viewer-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[29] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role"
        name                    = "kubero-operator-kuberoaddonmysql-admin-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[30] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role"
        name                    = "kubero-operator-kuberoaddonmysql-editor-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[31] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role"
        name                    = "kubero-operator-kuberoaddonmysql-viewer-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[32] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role"
        name                    = "kubero-operator-kuberoaddonpostgres-admin-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[33] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role"
        name                    = "kubero-operator-kuberoaddonpostgres-editor-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[34] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role"
        name                    = "kubero-operator-kuberoaddonpostgres-viewer-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[35] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role"
        name                    = "kubero-operator-kuberoaddonrabbitmq-admin-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[36] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role"
        name                    = "kubero-operator-kuberoaddonrabbitmq-editor-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[37] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role"
        name                    = "kubero-operator-kuberoaddonrabbitmq-viewer-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[38] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role"
        name                    = "kubero-operator-kuberoaddonredis-admin-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[39] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role"
        name                    = "kubero-operator-kuberoaddonredis-editor-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[40] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role"
        name                    = "kubero-operator-kuberoaddonredis-viewer-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[41] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role"
        name                    = "kubero-operator-manager-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[42] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader"
        name                    = "kubero-operator-metrics-reader"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[43] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role"
        name                    = "kubero-operator-proxy-role"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[44] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/rolebindings/kubero-operator-leader-election-rolebinding"
        name                    = "kubero-operator-leader-election-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[45] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding"
        name                    = "kubero-operator-manager-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[46] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding"
        name                    = "kubero-operator-proxy-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[47] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/api/v1/namespaces/kubero-operator-system/configmaps/kubero-operator-manager-config"
        name                    = "kubero-operator-manager-config"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[48] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/api/v1/namespaces/kubero-operator-system/services/kubero-operator-controller-manager-metrics-service"
        name                    = "kubero-operator-controller-manager-metrics-service"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[49] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
      + field_manager           = "kubectl"
        id                      = "/apis/apps/v1/namespaces/kubero-operator-system/deployments/kubero-operator-controller-manager"
        name                    = "kubero-operator-controller-manager"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubernetes_manifest.oauth2_auth_middleware[0] will be created
+ resource "kubernetes_manifest" "oauth2_auth_middleware" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "oauth2-proxy-auth"
              + namespace = "platform"
            }
          + spec       = {
              + forwardAuth = {
                  + address             = "http://oauth2-proxy.platform.svc.cluster.local/oauth2/auth"
                  + authResponseHeaders = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                      + "X-Auth-Request-Access-Token",
                    ]
                  + trustForwardHeader  = true
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "oauth2-proxy-auth"
              + namespace                  = "platform"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                  + responseCode     = (known after apply)
                }
              + compress          = {
                  + defaultEncoding      = (known after apply)
                  + encodings            = (known after apply)
                  + excludedContentTypes = (known after apply)
                  + includedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query          = (known after apply)
                  + service        = {
                      + healthCheck        = {
                          + followRedirects   = (known after apply)
                          + headers           = (known after apply)
                          + hostname          = (known after apply)
                          + interval          = (known after apply)
                          + method            = (known after apply)
                          + mode              = (known after apply)
                          + path              = (known after apply)
                          + port              = (known after apply)
                          + scheme            = (known after apply)
                          + status            = (known after apply)
                          + timeout           = (known after apply)
                          + unhealthyInterval = (known after apply)
                        }
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + nodePortLB         = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + domain   = (known after apply)
                              + httpOnly = (known after apply)
                              + maxAge   = (known after apply)
                              + name     = (known after apply)
                              + path     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status         = (known after apply)
                  + statusRewrites = (known after apply)
                }
              + forwardAuth       = {
                  + addAuthCookiesToResponse = (known after apply)
                  + address                  = "http://oauth2-proxy.platform.svc.cluster.local/oauth2/auth"
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                      + "X-Auth-Request-Access-Token",
                    ]
                  + authResponseHeadersRegex = (known after apply)
                  + forwardBody              = (known after apply)
                  + headerField              = (known after apply)
                  + maxBodySize              = (known after apply)
                  + preserveLocationHeader   = (known after apply)
                  + preserveRequestMethod    = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = true
                }
              + grpcWeb           = {
                  + allowOrigins = (known after apply)
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentSecurityPolicyReportOnly   = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipAllowList       = {
                  + ipStrategy       = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + rejectStatusCode = (known after apply)
                  + sourceRange      = (known after apply)
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + redis           = {
                      + db             = (known after apply)
                      + dialTimeout    = (known after apply)
                      + endpoints      = (known after apply)
                      + maxActiveConns = (known after apply)
                      + minIdleConns   = (known after apply)
                      + poolSize       = (known after apply)
                      + readTimeout    = (known after apply)
                      + secret         = (known after apply)
                      + tls            = {
                          + caSecret           = (known after apply)
                          + certSecret         = (known after apply)
                          + insecureSkipVerify = (known after apply)
                        }
                      + writeTimeout   = (known after apply)
                    }
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = (known after apply)
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

Plan: 2 to add, 52 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 2 to add, 52 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`